Repository: magi1125/inclusive-design-pattern
Catalog: tm/chapter-13_EN-US_JA.tmx
Source language: en_us
Languages: ja

source: A Blog Post
ja: ブログ記事

source: Keeping things prosaic for now, let’s look at paragraphs in context.
ja: まずは坦々と、パラグラフをコンテキストに照らして見ていきましょう。

source: I’ve had a blog for several years and it’s been through four to five design iterations.
ja: 私は数年間ブログを書いており、デザインの見直しを4、5回行いました。

source: Like many designer-bloggers, I seem to be afflicted with obsessive tinkering and I’m still not happy with the result.
ja: 多くのデザイナーブロガーと同じように、あちこちいじらずにはいられず、今も結果には満足していません。

source: Time is a luxury we often can’t afford on client projects — which is why client work sometimes gets finished, I suppose.
ja: クライアントのプロジェクトでは時間に余裕のない場合が多く、これが作業を完了させる理由となることもあるでしょう。

source: In my opinion, the most effective blog designs are spartan, focusing on content and removing as many distractions as possible.
ja: 個人的な意見ですが、最も効果的なブログのデザインは、コンテンツを中心とし、邪魔なものはできる限り取り除いた質素なデザインです。

source: It’s difficult to overestimate the effect of simplicity on both performance and accessibility.
ja: パフォーマンスとアクセシビリティのどちらの点でも、簡素であることには計り知れないほどの効果があります。

source: Not incorporating complex and ambitious layouts also puts you on the path to a more robust, flexible reading experience.
ja: また、複雑で凝ったレイアウトを作り込まないことで、より堅牢で柔軟な読みやすさを提供できます。

source: When the reader adjusts something, there’s simply less to break as a result.
ja: 読む人が何らかの調整を行った場合に、？？表示などの崩れが少なくなります。？？【コメント：多少意訳しています。原文「there’s simply less to break as a result.」】

source: Here, we’ll investigate the composition of an inclusive blog post as found at its permalink, forming the principal content of the parent page.
ja: ここでは、親ページの主要なコンテンツを形成するパーマリンクに見られる、インクルーシブなブログ記事の構成について探りましょう。

source: Semantic structure and source order must be taken into account.
ja: セマンティックな構造とソースの順序を考慮する必要があります。

source: I’ll also cover effective link text, incorporating video content, and the creation of an automated flow system to ease the work of content editors.
ja: また、効果的なリンクテキスト、ビデオコンテンツの組み込み、コンテンツ編集者の作業を容易にする自動化されたフローシステムの作成についても説明します。

source: The <main> Element
ja: <main>要素

source: You may recall the <main> element from our setup in “The Document.” Every web page should have a <main> element to identify the unique content of that page.
ja: 「＄＄The Document＄＄」でセットアップした<main>要素を思い出してください。すべてのWebページには、そのページ独自のコンテンツを特定する<main>要素があります。

source: The element helps us to think about what the main content of our page actually is, and can later be used as a navigational aid by screen reader operators.
ja: この要素は、そのページの実際のメインコンテンツは何であるかについて考えるのに役立ちます。また、後でスクリーンリーダーユーザーがナビゲーション手段としてとして利用することもできます。

source: At a blog permalink, the salient content is the blog article itself, so it should be placed inside <main>.
ja: ブログのパーマリンクでは、主要なコンテンツがブログ記事そのものであるため、これを<main>の中に置く必要があります。

source: Note the id below, which allows keyboard users to navigate to the article via a skip link (also discussed in “The Document”):
ja: 下のidに注目してください。これは、キーボードユーザーがスキップリンクを介して記事に移動できるようにするためのものです（これも「＄＄TheDocument＄＄」で説明しました）。

source: <main id="main"> <!-- blog article here --> </main>
ja: <main id="main"> <!—ここがブログ記事--> </main>

source: When incorporating complex grid systems, we tend to rely heavily on <div>-based scaffolding.
ja: 複雑なグリッドシステムを組み込むとき、私たちは<div>に基づく枠組みに大きく依存しがちです。

source: This may help us to corral the visual structure of the page, but it has no impact on the semantic structure.
ja: これはページの視覚的な構造を枠に入れるのに役立つかもしれませんが、セマンティックな構造にはなんの効果もありません。

source: That is, the following code example is semantically identical to the preceding one.
ja: つまり、以下のコード例は、意味的には前のコードと同じです。

source: The source code is just more complex.
ja: ソースコードが複雑になっているにすぎません。

source: <div class="grid_50"> <div class="grid_50_inner"> <main id="main"> <div class="main_inner"> <!-- blog article here --> </div> </main> </div> </div>
ja: <div class="grid_50"> <div class="grid_50_inner"> <main id="main"> <div class="main_inner"> <!—ここがブログ記事--> </div> </main> </div> </div>

source: In general, I recommend against dealing with third-party grid systems.
ja: 一般に、サードパーティのグリッドシステムを使うことはお勧めしません。

source: They’re typically rather large assets themselves and encourage convoluted, redundant markup.
ja: 通常、それ自体が大きなアセットとなり、複雑で冗長なマークアップが増加します。

source: Not only does this produce a larger document to download, but also it can have additional, unpleasant side effects.
ja: ダウンロードするドキュメントが大きくなるだけでなく、不快な副作用が発生することもあります。

source: For example, in testing I’ve experienced a screen reader producing erroneous output as it struggled to parse a massive DOM.
ja: たとえば、私がテストをしていたときに、スクリーンリーダーが大きなDOMをなかなか解析できず、誤った出力を生成したことがありました。

source: If you’re building a highly complex layout, a grid system may help you.
ja: 非常に複雑なレイアウトを構築するのであれば、グリッドシステムは役に立つかもしれません。

source: However, you should not be building a highly complex layout.
ja: しかし、非常に複雑なレイアウトは構築すべきでないのです。

source: Simple user interfaces are usable interfaces, accessible interfaces, maintainable interfaces, and performant interfaces.
ja: シンプルなユーザーインターフェイスこそが、使い勝手の良いインターフェイスであり、アクセシブルなインターフェイスであり、パフォーマンスの高いインターフェイスなのです。

source: In print design, where the relative position of grid elements is reliable and consistent, you can rely on juxtaposition to convey meaning and use terminology like, “the photograph to the right.” On the responsive web, you don’t have this luxury.
ja: 印刷物のデザインでは、グリッド要素の相対位置は一貫していて信頼できるため、意味を伝えるために横に並べて配置したり、「右の写真」といった言い方をすることができます。レスポンシブWebでは、こんな贅沢なことはできません。

source: Occasionally, you’ll still want to put somethings next to some other things, if only to be intensive with the available space.
ja: それでも時として、空きスペースを有効に利用するため、何かを横に並べたいと思うことがあるでしょう。

source: But there’s no use trying to be exacting.
ja: ？？しかし、どんなに頑張っても表示の崩れは防げません。？？【コメント：意訳しています。原文「But there’s no use trying to be exacting.」】

source: I’ll talk more about the terseness with which you can create responsive, self-managing grids1 using Flexbox in the “A Filter Widget” chapter.
ja: flexboxを使用して、レスポンシブな自己管理型のグリッド（脚注36）を作ることができる簡潔さについては、「＄＄A Filter Widget＄＄」の章で詳しく説明します。

source: Heading Structure
ja: 見出しの構造

source: I’m concerned we only usually look at HTML semantics in terms of discrete elements providing meaning, and not by looking at their relationships to one another.
ja: 私はいつも、HTMLのセマンティクスが、意味を提供している個別の要素という観点からのみ見られており、互いの関係が見られていないことを懸念しています。

source: While it’s true the element <main> itself provides idiosyncratic behaviors, these benefits can be diminished with improper placement; for example, by using multiple <main> elements on a single page or by using <main> to wrap the entire DOM.
ja: <main>要素そのものが独特な動作を提供しているのは確かですが、これらのメリットは、不正な配置によって損なわれることもあります。たとえば、単一のページで複数の<main>要素を使ったり、<main>を使用してDOM全体をラップしたりといった不正です。

source: Heading elements in particular derive much of their meaning from their relationships with one another.
ja: 特に見出し要素は、意味の多くが互いの関係性からもたらされます。

source: The Element
ja: 要素

source: The element represents your document’s first-level heading.
ja: 要素は、ドキュメントの第1レベルの見出しを表します。

source: It is the top heading of the document.
ja: そのドキュメントのトップの見出しです。

source: At our permalink, it should be the title of the blog article itself.
ja: ここでのパーマリンクでは、ブログ記事のタイトルそのものにします。

source: The text effectively labels the supersection that is the document body, so it’s not logical to have more than one per page.
ja: テキストは実質的に、ドキュメントの本文である？？スーパーセクション？？のラベルとなります。【コメント：不安訳です。原文「supersection」】このため、1ページに複数あるのは論理的に正しくありません。

source: <main id="main"> How To Mark Up Inclusive Blog Articles </main>
ja: <main id="main"> インクルーシブなブログ記事のマークアップ方法 </main>

source: Like the <main> element, the exposes a navigation shortcut for assistive technology users.
ja: <main>要素と同じく、は、支援技術ユーザーにナビゲーションショートカットを公開します。

source: Both NVDA and JAWS users can press the 1 key and their screen readers will transport them directly to the , where “How To Mark Up Inclusive Blog Articles, heading level one” will be announced.
ja: NVDAとJAWSのユーザーは、1キーを押すと、スクリーンリーダーによって直接に移動でき、ここでは「インクルーシブなブログ記事のマークアップ方法、＃＃heading level one＃＃」と読み上げられます。

source: Practically speaking, the <main> and offer similar functionality, so why employ both?
ja: 実質的に、<main>とは似たような機能を提供していますが、両方を使用するのはなぜでしょうか？

source: Because not all screen reader users are alike.
ja: これは、スクリーンリーダーユーザーが皆同じではないからです。

source: In my informal research into screen reader users’ behaviors and preferences2, some respondents were familiar and comfortable with landmark (region) navigation, but the majority used headings to get around.
ja: 私が行った、スクリーンリーダーユーザーの行動および好みに関する非公式の研究（脚注37）では、一部の回答者はランドマーク（リージョン）ナビゲーションを熟知して使いこなしていたものの、大半の回答者は見出しを使って移動していました。

source: Providing unobtrusive options for users is sometimes called multimodality.
ja: ユーザーに目立たない複数のオプションを提供することを、？？マルチモダリティ？？と呼ぶことがあります。【コメント：定訳が確認できませんでした】

source: It’s why we should also provide transcripts alongside video content.
ja: それこそが、ビデオコンテンツにトランスクリプト？？（内容を文字に書き起こしたもの）？？を添えるべき理由です。【コメント：補足しました】

source: More on that shortly.
ja: これについては、この後、詳しく説明します。

source: A number of survey respondents also professed to navigate documents from element to element, reading from the start to the end using their screen reader’s down arrow key (or equivalent).
ja: また、回答者の何人かは、スクリーンリーダーの下矢印キー（または同等のキー）を使用して、ドキュメントを先頭から末尾に向かって、要素から要素へと移動していると答えています。

source: Source order is an important dimension of structure and our blog article should make sense read from top to bottom.
ja: ソースの順序は構造の重要な側面であり、ブログ記事は上から下に読んで意味が通らなくてはなりません。

source: Though it can be made to look visually compelling either way, it is therefore important not to open an article with its publish date, but with its heading.
ja: どちらでも視覚的に分かりやすい外観にできますが、上記の理由から、記事を公開日付ではなく、見出しで開始することが大切です。

source: <!-- don’t use this --> <main id="main"> <div class="meta">Published on <time datetime="2017-12-12">12/12/2017</time></div> How To Mark Up Inclusive Blog Articles <!-- article content here --> </main> <!-- use this --> <main id="main"> How To Mark Up Inclusive Blog Articles <div class="meta">Published on <time datetime="2017-12-12">12/12/2017</time></div> <!-- article content here --> </main>
ja: <!-- これは使わないでください --> <main id="main"> <div class="meta">公開日<time datetime="2017-12-12">12/12/2017</time></div> インクルーシブなブログ記事のマークアップ方法 <!—ここが記事のコンテンツ--> </main> <!—これを使ってください--> <main id="main"> インクルーシブなブログ記事のマークアップ方法 <div class="meta">公開日<time datetime="2017-12-12">12/12/2017</time></div> <!—ここが記事のコンテンツ--> </main>

source: In the first, commented out example, someone navigating by heading using the generic h key would be unaware of the publish date because the screen reader would take them silently past it.
ja: 1つ目の例では、汎用的なhキーを使用して見出しでナビゲートしている人には公開日付は分かりません。スクリーンリーダーは読み上げずにこれを通過します。

source: Shows how heading navigation bypasses section content that precedes sections’ headings.
ja: 見出しナビゲーションでは、セクションの見出しの前にあるセクションコンテンツがスキップされます。

source: Note that the first structure is unlikely to produce an error in an automated accessibility testing tool.
ja: 1つ目の構造は、自動化されたアクセシビリティテストツールでは、おそらくエラーを生成しないことに注意してください。

source: That does not mean the second structure is not preferable.
ja: これは2番目の構造の方が好ましくないという意味ではありません。

source: Inclusive design is about appreciating how people really use interfaces, not just fixing technical errors.
ja: インクルーシブデザインの目的は、単に技術的なエラーを修正することではなく、ユーザーが実際にインターフェイスを使用する方法を正しく理解することです。

source: Subsections
ja: サブセクション

source: When it comes to structure, depth is just as important as source order.
ja: 構造に関しては、ソースの順序と同じくらい大事なのが深さです。

source: By dividing our blog article into subsections, we can describe which parts of it belong to which other parts, building a thematic map or outline.
ja: ブログ記事をサブセクションに分割することで、どの部分がどの部分に属しているかを説明し、セマンティックなマップまたはアウトラインを構築できます。

source: Despite the inclusion of nestable sectioning elements in the HTML5 specification, like <section>, the only elements currently able to describe depth in an inclusive fashion are to .
ja: HTML5仕様には<section>などのネスト可能なセクショニング要素が含まれていますが、現在のところ、インクルーシブな方法で深さを記述できる要素は～だけです。

source: That’s not to say you shouldn’t use <section> or <article>, but the information they provide does not serve this particular purpose.
ja: <section>や<article>は使用すべきでないとは言いませんが、これらが提供する情報は、インクルーシブな方法での深さの記述という目的を果たしません。

source: The HTML5 outline algorithm was specified to automate section structure based on sectioning elements, removing the need for –.
ja: HTML5のアウトラインアルゴリズムは、セクショニング要素に基づいてセクションの構造を自動化し、～を不要にするよう指定されていました。

source: However, it is not implemented in any user agent3, and there’s no sign it ever will be.
ja: しかし、これはどのユーザーエージェントにも実装されておらず（脚注38）、今後実装されそうな兆候もありません。

source: As stated, our blog article should begin with an .
ja: 前述のように、ブログ記事はで開始すべきです。

source: You could stop there, but the lack of further structural information would produce comprehension issues for a broad range of users.
ja: これだけでも良いですが、これ以上の構造情報がないと、多くのユーザーに理解の点で問題が生じます。

source: You should always aim to divide your content into digestible chunks.
ja: 常にコンテンツは、理解しやすい塊に分けるよう努めるべきです。

source: That’s ultimately what HTML is for: forming structure through differentiation.
ja: HTMLの最終的な目的は、分化を通じて構造を形成することですから。

source: To create a subsection within the article, use .
ja: 記事内にサブセクションを作成するには、を使用します。

source: The 2 in says “two levels deep,” or “one down from the first level.” Visually, headings are conventionally differentiated by font size: the deeper the level, the smaller the font-size.
ja: の2が意味しているのは、「レベル2の深さ」つまり「第1レベルから1つ下がったレベル」ということです。視覚的には、見出しはフォントサイズで区別されるのが慣習となっており、レベルが深いほどfont-sizeは小さくなります。

source: This is where a lot of developers make a mistake: they choose a heading element which they believe best fits the perceived importance of the section it represents.
ja: ここで、多くの開発者がミスをします。見出しが表すセクションの認識上の重要性に最も合うと思う見出し要素を選んでしまうのです。

source: For example, a developer might choose an in place of an because they deem the section unimportant and would like to reduce the font-size accordingly.
ja: たとえば、そのセクションは重要ではないと思い、font-sizeを小さくしたいと考えて、ではなくを選択することがあります。

source: This deceives both visual and non-visual readers because it breaks the perceived structure — a level has been skipped.
ja: これは、認識されている構造を壊し、レベルが1つスキップされるため、視覚的な読者と非視覚的な読者の両方を欺くことになります。

source: How To Mark Up Blog Articles <!-- introductory content --> A quick note on the word ‘semantic’ <!-- wait!
ja: ブログ記事のマークアップ方法 <!-- 序文コンテンツ--> 「セマンティック」という単語について <!-- 待って！

source: Where’s the second nesting level?
ja: 2番目のネストレベルはどこに？

source: Three nested boxes representing a section/subsection structure.
ja: セクション（レベル1）

source: The middle subsection is labeled missing.
ja: 欠けているサブセクション（レベル2）

source: Missing layers in document structure can be disorienting to users trying to build a mental map of the document.
ja: ドキュメント構造内で階層が欠けていると、頭の中でドキュメントのマップを作ろうとしているユーザーを混乱させます。

source: Some developers handle heading styles separately using CSS classes.
ja: CSSクラスを使って見出しのスタイルを別に処理する開発者もいます。

source: This gives them the freedom to change font sizes independent of semantic structure.
ja: この方法では、セマンティックな構造に依存することなく、自由にフォントサイズを変更することができます。

source: <h2 class="h3">What am I?
ja: <h2 class="h3">私は何でしょう？

source: While this method eschews having to make structural errors to achieve visual effects, exercise caution: in most cases, an should look like an .
ja: この方法では、視覚的な効果を得るための構造エラーを回避できますが、注意が必要です。たいていの場合、はらしい見た目にすべきです。

source: That’s what it is, after all!
ja: 結局のところ、そういうことなのです！

source: Part of inclusion is achieving a parity of experience across different user needs.
ja: インクルージョンの役割は、多様なユーザーニーズ全体の体験を平均化することです。

source: By managing content visually one way and non-visually another way, you begin to segregate seeing and non-seeing users.
ja: ある方法で視覚的にコンテンツを処理し、非視覚的にはまた別の方法でコンテンツを処理するのは、見えているユーザーと見えていないユーザーの隔離を始めているということです。

source: A syndicated version of your content, subject to a different style sheet, would diverge in visual structure too.
ja: 複数のスタイルシートの影響を受ける、寄せ集めて作られたコンテンツは、視覚的な構造も異なるものとなります。

source: Subtitles
ja: サブタイトル

source: Blog articles in which the author has not been able to say everything they want in a title alone sometimes employ subtitles or straplines.
ja: ブログ記事を書く人が1つのタイトルで書きたいことすべてを書けなかった場合、サブタイトルや小見出しを使用することがあります。

source: This also applies to books…
ja: これは本にも当てはまります。

source: The previous example could be rewritten to take the title “How To Mark Up Blog Articles” and the subtitle “In Seven Simple Steps.” The question is how to mark this up.
ja: 前の例は、タイトルを「ブログ記事のマークアップ方法」とし、サブタイトルを「7つのシンプルステップ」とすることもできます。問題はこれをどのようにマークアップするかです。

source: I’ve seen many an implementation which chooses to put the subtitle in a separate heading element, like so:
ja: 以下のように、別の見出し要素にサブタイトルを入れている例を多数見たことがあります。

source: <main id="main"> How To Mark Up Blog Articles In Seven Simple Steps <!-- this should not be a heading --> <div class="meta">Published on <time datetime="2017-12-12">12/12/2017</time></div> <!-- article content here --> </main>
ja: <main id="main"> ブログ記事のマークアップ方法 7つのシンプルステップ<!—これは見出しにすべきではありません--> <div class="meta">公開日 <time datetime="2017-12-12">12/12/2017</time></div> <!—ここが記事のコンテンツ--> </main>

source: Now that you’re familiar with the structural contribution of headings, you should be able to see the problem: the creates an immediate subsection, “In Seven Easy Steps.” That’s a pretty weird, fragmentary heading for a section and would make little sense wherever a table of contents is generated:
ja: ここまでに見出しの構造的な役割を十分に学習してきた皆さんには、何が問題かお分かりでしょう。それは、が直接的なサブセクション「？？7つのシンプルステップ？？」を作成するということです。【コメント：原文「“In Seven Easy Steps.”」。前の説明文と例では「In Seven Simple Steps」となっていますが同一のものを指していると判断して同じ訳をあてました。複数あり、？？で囲みました】？？これはセクションの見出しとしては奇妙で断片的であり、目次が生成されてもほとんど意味を成さないでしょう。？？【コメント：日本語訳の場合、不自然ではありません】

source: •How To Mark Up Blog Articles
ja: • ブログ記事のマークアップ方法

source: •In Seven Simple Steps
ja: • 7つのシンプルステップ

source: •Headings
ja: • 見出し

source: •Subsections
ja: • サブセクション

source: •Link text
ja: • リンクテキスト

source: For a short time, the <hgroup> element was the prescribed solution.
ja: 一時は、<hgroup>要素が所定の解決策でした。

source: By wrapping the and in an <hgroup>, you could theoretically remove the from the outline, preventing it from creating a subheading:
ja: 以下のように、とを<hgroup>内にラップすることで、理論上はアウトラインからを取り除き、サブ見出しが作成されないようにすることができます。

source: <!-- do not use --> <hgroup> How To Mark Up Blog Articles In Seven Simple Steps </hgroup>
ja: <!-- 使わないでください--> <hgroup> ブログ記事のマークアップ方法 7つのシンプルステップ </hgroup>

source: As this MDN article on <hgroup>4 attests, however, <hgroup> has been removed from the HTML5 specification.
ja: しかし、<hgroup>についてのMDN記事（脚注39）に示されているように、<hgroup>はHTML5仕様から削除されています。

source: You cannot therefore depend on it becoming implemented uniformly or reliably in browsers.
ja: このため、<hgroup>が各種ブラウザに一様にまたは確実に実装されていることを前提としてはなりません。

source: Finding the right solution depends on what we want to achieve.
ja: 正しい解決策は、何を行いたいかによります。

source: If we want “In Seven Easy Steps” to be part of the title, we can separate it with a semantically inert <span> element and drop it onto a new line using h1 span { display: block; }.
ja: 「？？7つのシンプルステップ？？」をタイトルの一部にしたい場合は、特別な意味を持たない<span>要素でこれを区切り、h1span{ display:block;}を使用して新しい行にすることができます。【コメント：原文「InSeven Easy Steps」】

source: How To Mark Up Blog Articles <span>In Seven Easy Steps</span>
ja: ブログ記事のマークアップ方法 <span>7つのシンプルステップ </span>

source: This would produce the following, corrected outline:
ja: こうすると以下のような修正されたアウトラインが生成されます。

source: •How To Mark Up Blog Articles In Seven Simple Steps
ja: • ブログ記事のマークアップ方法 7つのシンプルステップ

source: Instead, you might deem the subtitle unimportant and want to remove its text from the outline altogether.
ja: そうではなく、サブタイトルは重要でないため、そのテキストをアウトラインからすべて削除したいこともあります。

source: In which case, the following solution could work:
ja: このような場合には、以下の方法で対処できます。

source: How To Mark Up Blog Articles <p><span class="visually-hidden">Subtitle:</span> In Seven Easy Steps</p>
ja: ブログ記事のマークアップ方法 <p><span class="visually-hidden">サブタイトル：</span> 7つのシンプルステップ</p>

source: Note the use of the <span> with the .visually-hidden class.
ja: <span>で.visually-hiddenクラスが使用されていることに注目してください。

source: Visually, the role of the subtitle would presumably be indicated by its styling.
ja: 視覚的には、サブタイトルの役割はおそらくスタイルで示されます。

source: In a non-visual context, this would not be apparent: Traversing from the to the <p> would have a screen reader believe that they had begun reading the article body.
ja: 非視覚的なコンテキストでは、これが分かりません。から<p>へのトラバースで、スクリーンリーダーは、記事の本文を読み始めたのだと考えるでしょう。

source: By providing the prefix “Subtitle:” we clarify the role of the <p> element non-visually, in much the same way as the implicit role of a <button> element makes screen readers announce “Button.”
ja: ここでは、接頭辞として「サブタイトル：」と付けることで、非視覚的に<p>の役割を明確化しています。これは、<button>要素の暗黙的な役割によって、スクリーンリーダーが「ボタン」と読み上げるのとほぼ同じようなことです。

source: The .visually-hidden class invokes a special set of properties, carefully devised to hide the element visually without it becoming silenced in screen reader software.
ja: .visually-hiddenクラスは、特別なプロパティセットを呼び出し、スクリーンリーダーソフトウェアで読み上げを回避されることなく、要素を視覚的に巧みに隠します。

source: Using display: none;, visibility: hidden;, height: 0; or width: 0; wouldn’t work — it would make the span unavailable both visually and aurally.
ja: display: none;、visibility: hidden;、height: 0;、width: 0;を使用したのではうまく機能しません。視覚的にも聴覚的にもspanが利用できなくなります。

source: Having such a utility class in your style sheet and at your disposal is always recommended.
ja: このようなユーティリティクラスをスタイルシートに用意し、自由に使えるようにしておくことをお勧めします。

source: In later chapters, we’ll call on .visually-hidden a number of times.
ja: .visually-hiddenは後の章でも何度か出てきます。

source: Should a <subtitle> element ever be specified, the clarifying “Subtitle:” prefix would probably be provided for you as a feature of the element’s role, and therefore automatically available in the “accessibility tree5” — the version of the DOM used by assistive technologies where roles, properties, states, labels and values are exposed.
ja: <subtitle>要素が指定されている場合、明確にするための接頭辞「サブタイトル：」は、おそらく要素の役割の機能として提供され、「アクセシビリティツリー」（脚注40）で自動的に利用可能になるでしょう。アクセシビリティツリーとは、支援技術で使用されるDOMの一種で、役割、プロパティ、状態、ラベル、および値が表示されます。

source: Aside from providing interactive behaviors, this is one of the simple benefits of using semantic elements where they are specified and supported.
ja: インタラクティブな動作を提供することは別として、これはセマンティックな要素を、指定されサポートされているところで使用する単純なメリットの1つです。

source: The <article> Element
ja: <article>要素

source: There is a lot of confusion surrounding HTML5 sectioning elements.
ja: HTML5のセクショニング要素については多くの混乱があります。

source: For example, you may be asking, “If this is an article, shouldn’t it be in an <article> element?”
ja: たとえば、「これが記事（article）であれば、<article>要素に入れるべきではないの？」と思われるかもしれません。

source: <main id="main"> <article> How To Mark Up Inclusive Blog Articles <div class="meta">Published on <time datetime="2017-12-12">12/12/2017</time></div> <!-- article content here --> </article> </main>
ja: <main id="main"> <article> インクルーシブなブログ記事のマークアップ方法 <div class="meta">公開日 <time datetime="2017-12-12">12/12/2017</time></div> <!—ここが記事のコンテンツ--> </article> </main>

source: The answer is: probably not, but maybe.
ja: その答えは、「たぶん違うけどそうかもしれない」です。

source: Theoretically, the <article> should start a new subsection by deferring to the HTML5 outline algorithm6.
ja: 理論上は、<article>はHTML5アウトラインアルゴリズムに従って、新しいサブセクションを開始します。

source: It would be poorly placed here because we haven’t even begun the main content of the document (which is the outermost section).
ja: （脚注41）この例では、まだドキュメントのメインコンテンツも開始していないため（最も外側のセクション）、ここに置くのは正しくありません。

source: But, since the outline algorithm is not actually implemented in any user agents7, this has no effect on assistive technology users.
ja: しかし、実際にはいずれのユーザーエージェントにもアウトラインアルゴリズムが実装されていないため、（脚注42）支援技術ユーザーにとってこれは何の効果も、

source: No harm done.
ja: 害もありません。

source: Unlike the <main> element, <article> is not a landmark, so few screen readers provide it as a navigational tool.
ja: <main>要素とは異なり、<article>はランドマークではありません。このため、<article>をナビゲーションツールとして提供しているスクリーンリーダーはほとんどありません。

source: Since it’s the singular child of <main>, it would take the user to the same place anyway.
ja: <main>の単一の子であるため、どちらにしてもユーザーを同じ場所に移動します。
